dafoam_pytorch_hfdib_demo/datasets/four_port_64/topology_195/case/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    inletLower
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    inletUpper
    {
        type            fixedValue;
        value           uniform (0.1 0 0);
    }
    outletLower
    {
        type            zeroGradient;
    }
    outletUpper
    {
        type            zeroGradient;
    }
    sideWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topBottomWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            symmetry;
    }
}
